#!/bin/bash

# Команди для перевірки стану мережевого оточення
# Використання без параметрів

echo "Дізнаємось ip адресу сайту Амазон..."
host amazon.com > /dev/tty 2>&1
echo "----------------------------------------------------------"

echo "Тепер дізнаємось чи є доменне ім'я у DNS серверу Google..."
nslookup 8.8.8.8 > /dev/tty 2>&1
echo "----------------------------------------------------------"

echo "Подивимось куди заведе нас dig google.com"
dig google.com > /dev/tty 2>&1
echo "----------------------------------------------------------"

echo "Дістанемо сторінку Google..."
wget google.com > /dev/tty 2>&1
echo "----------------------------------------------------------"

echo "Давайте подивимось на мережеву статистику..."
netstat >/dev/tty 2>&1
echo "----------------------------------------------------------"

echo "Виуористаємо ping до facebook.com..."
ping -c 3 facebook.com >/dev/tty 2>&1
echo "----------------------------------------------------------"